while True:
    # მომხმარებლისგან შესვლის მიღება
    user_input = input("შეიყვანეთ სამ ასოიანი სიტყვა: ")

    # შევამოწმოთ, თუ სიტყვა სამი ასოიანი არაა
    if len(user_input) != 3:
        print("თქვენ უნდა შეიყვანოთ ზუსტად სამი ასო!")
        continue  # თუ არა სამი ასო, პროგრამა იწყებს თავიდან
    else:
        # თუ სიტყვა სამ ასოიანია, შევამოწმოთ, არის თუ არა ის პალინდრომი
        is_palindrome = user_input == user_input[::-1]
        print(is_palindrome)  # True თუ პალინდრომია, False თუ არ არის
        break  # დამთავრდება პროგრამა, თუ სიტყვა სწორი ფორმატით შევიდა